; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 558456 2 3 4 3 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	thermograph3 - mode
	image0 - mode
	spectrograph1 - mode
	infrared2 - mode
	Star0 - direction
	GroundStation2 - direction
	Star1 - direction
	Star3 - direction
	Phenomenon4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon4)
	(supports instrument1 infrared2)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph3)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(have_image Star3 infrared2)
	(have_image Phenomenon4 image0)
	(have_image Star5 infrared2)
	(have_image Phenomenon6 spectrograph1)
	(have_image Star7 image0)
	(have_image Star8 thermograph3)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (turn_to satellite1 star1 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star1)
   goals met: 0 of 6
4. (turn_to satellite0 star0 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star0)
   goals met: 0 of 6
5. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 6
6. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 6
7. (turn_to satellite1 star8 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star8)
   goals met: 0 of 6
8. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
9. (take_image satellite1 star8 instrument2 thermograph3)
   added: (have_image star8 thermograph3)
   goals met: 1 of 6
10. (take_image satellite0 star7 instrument0 image0)
   added: (have_image star7 image0)
   goals met: 2 of 6
11. (turn_to satellite1 star3 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star3)
   goals met: 2 of 6
12. (turn_to satellite0 phenomenon4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon4)
   goals met: 2 of 6
13. (take_image satellite0 phenomenon4 instrument0 image0)
   added: (have_image phenomenon4 image0)
   goals met: 3 of 6
14. (turn_to satellite1 phenomenon6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon6)
   goals met: 3 of 6
15. (take_image satellite1 phenomenon6 instrument2 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 4 of 6
16. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 4 of 6
17. (turn_to satellite1 star3 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star3)
   goals met: 4 of 6
18. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 4 of 6
19. (turn_to satellite1 groundstation2 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 groundstation2)
   goals met: 4 of 6
20. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 4 of 6
21. (turn_to satellite1 star3 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star3)
   goals met: 4 of 6
22. (take_image satellite1 star3 instrument1 infrared2)
   added: (have_image star3 infrared2)
   goals met: 5 of 6
23. (turn_to satellite1 star5 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star5)
   goals met: 5 of 6
24. (take_image satellite1 star5 instrument1 infrared2)
   added: (have_image star5 infrared2)
   goals met: 6 of 6
